package Homeworks.Homework08.test;

/* === Домашнее задание №8 по теме «Java Collections. Stream API», дополнительное задание ===
   1. Реализовать класс Автомобиль. У класса есть поля "Номер автомобиля"; Модель; Цвет; Пробег; Стоимость,
      свойства и методы.
   2. Проверить работу в классе Main, методе main.
   3. Создать объект Java Collections со списком автомобилей.
   4. Используя Java Stream API, вывести:
      1)  Номера всех автомобилей, имеющих заданный в переменной цвет colorToFind или нулевой пробег mileageToFind.
      2а) Количество уникальных автомобилей в ценовом диапазоне от n до m
      2б) Количество уникальных моделей в ценовом диапазоне от n до m.
      3)  Вывести цвет автомобиля с минимальной стоимостью.
      4а) Среднюю стоимость искомой модели modelToFind
      4б) Среднюю стоимость искомой модели modelToFind1
      4в) Среднюю стоимость искомой модели modelToFind2
   5. Реализовать ввод и вывод программы в файл *.txt.
   6. Вынести методы работы с автомобилем в папку repository интерфейс
      CarsRepository и его реализацию CarsRepositoryImpl.
   7. Доработать программу до следующей структуры
      * файл с данными по пути от main : ../data/cars.txt
      * файл с результатами по пути от main : ../data/result.txt
   8. CarsRepository обеспечивает уникальность номера автомобиля в списке
*/


public class Main {
}
